
/**
 * 日德（又称干德）：甲己日寅，乙庚日申，丙辛日巳，丁壬日亥，戊癸日巳。
 */
export const riDe = {
    "甲": "寅",
    "乙": "申",
    "丙": "巳",
    "丁": "亥",
    "戊": "巳",
    "己": "寅",
    "庚": "申",
    "辛": "巳",
    "壬": "亥",
    "癸": "巳"
}
/**
 * 甲禄在寅、乙禄在卯、丙禄在巳、丁禄在午、戊禄在巳、己禄在午、庚禄在申、辛禄在酉、壬禄在亥、癸禄在子。
 */
export const riLu = {
    "甲": "寅",
    "乙": "卯",
    "丙": "巳",
    "丁": "午",
    "戊": "巳",
    "己": "午",
    "庚": "申",
    "辛": "酉",
    "壬": "亥",
    "癸": "子"
}

/**
 * 生气：正月在子 顺行 十二
 */
export const ShengQi = {
    "寅": "子",
    "卯": "丑",
    "辰": "寅",
    "巳": "卯",
    "午": "辰",
    "未": "巳",
    "申": "午",
    "酉": "未",
    "戌": "申",
    "亥": "酉",
    "子": "戌",
    "丑": "亥"
}
/**
 * 死气：正月起午 顺行 十二
 */
export const SiQi = {
    "寅": "午",
    "卯": "未",
    "辰": "申",
    "巳": "酉",
    "午": "戌",
    "未": "亥",
    "申": "子",
    "酉": "丑",
    "戌": "寅",
    "亥": "卯",
    "子": "辰",
    "丑": "巳"
}